xml2json.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ngis="http://yurticikargo.com.tr/NgiShipmentInterfaceServices"><soapenv:Header /><soapenv:Body>

<ngis:createNgiShipmentWithAddress>

<wsUserName>test</wsUserName>
<wsPassword>test</wsPassword>
<wsUserLanguage>TR</wsUserLanguage>

<shipmentData>
    <ngiDocumentKey>test</ngiDocumentKey>
    <cargoType>t</cargoType>
    <totalCargoCount>1</totalCargoCount>
    <totalDesi>9.3</totalDesi>
    <totalWeight>9.3</totalWeight>
    <personGiver>test</personGiver>
    <description>test</description>
    <selectedArrivalUnitId></selectedArrivalUnitId>
    <selectedArrivalTransferUnitId></selectedArrivalTransferUnitId>
    <productCode>STA</productCode>
    <complementaryProductDataArray>
        <complementaryProductCode>TT</complementaryProductCode>
    </complementaryProductDataArray>
    <complementaryProductDataArray>
        <complementaryProductCode>KK</complementaryProductCode>
    </complementaryProductDataArray>
    <docCargoDataArray>
        <ngiCargoKey>test</ngiCargoKey>
        <cargoType>t</cargoType>
        <cargoDesi>9.3</cargoDesi>
        <cargoWeight>9.3</cargoWeight>
        <cargoCount>1</cargoCount>
        <weightUnit>KGM</weightUnit>
        <length/>
        <width/>
        <height/>
        <dimensionsUnit>CM</dimensionsUnit>
        <docCargoSpecialFieldDataArray>
          <specialFieldName>54</specialFieldName>
          <specialFieldValue>QN058043059401</specialFieldValue>
          <specialFieldName>3</specialFieldName>
          <specialFieldValue>QN058043059401</specialFieldValue>
        </docCargoSpecialFieldDataArray>
    </docCargoDataArray>
    <docCargoDataArray>
        <ngiCargoKey>test</ngiCargoKey>
        <cargoType>t</cargoType>
        <cargoDesi>9.3</cargoDesi>
        <cargoWeight>9.3</cargoWeight>
        <cargoCount>1</cargoCount>
        <weightUnit>KGM</weightUnit>
        <length/>
        <width/>
        <height/>
        <dimensionsUnit>CM</dimensionsUnit>
        <docCargoSpecialFieldDataArray>
          <specialFieldName>54</specialFieldName>
          <specialFieldValue>QN058043059401</specialFieldValue>
        </docCargoSpecialFieldDataArray>
        <docCargoSpecialFieldDataArray>
          <specialFieldName>3</specialFieldName>
          <specialFieldValue>QN058043059401</specialFieldValue>
        </docCargoSpecialFieldDataArray>
    </docCargoDataArray>
    <specialFieldDataArray>
        <specialFieldName>54</specialFieldName>
          <specialFieldValue>QN058043059401</specialFieldValue>
    </specialFieldDataArray>
    <specialFieldDataArray>
          <specialFieldName>3</specialFieldName>
          <specialFieldValue>QN058043059401</specialFieldValue>
    </specialFieldDataArray>
    <codData>
        <ttInvoiceAmount>155.5</ttInvoiceAmount>
        <ttDocumentId>test</ttDocumentId>
        <ttCollectionType>t</ttCollectionType>
        <ttDocumentSaveType>t</ttDocumentSaveType>
        <dcSelectedCredit>2</dcSelectedCredit>
        <dcCreditRule>t</dcCreditRule>
    </codData>
</shipmentData>

<XSenderCustAddress>
    <senderCustName>test</senderCustName>
    <senderAddress>test</senderAddress>
    <cityId>test</cityId>
    <townName>test</townName>
    <senderPhone>test</senderPhone>
    <senderMobilePhone>test</senderMobilePhone>
    <senderEmailAddress>test</senderEmailAddress>
    <senderCustReferenceId>test</senderCustReferenceId>
    <senderAddressReferenceId>test</senderAddressReferenceId>
    <senderAdditionalInfo></senderAdditionalInfo>
    <latitude></latitude>
    <longitude></longitude>
</XSenderCustAddress>

<XConsigneeCustAddress>
    <consigneeCustName>test</consigneeCustName>
    <consigneeAddress>test</consigneeAddress>
    <cityId>test</cityId>
    <townName>test</townName>
    <consigneePhone>test</consigneePhone>
    <consigneeMobilePhone>test</consigneeMobilePhone>
    <consigneeEmailAddress>test</consigneeEmailAddress>
    <consigneeCustReferenceId>test</consigneeCustReferenceId>
    <consigneeAddressReferenceId>test</consigneeAddressReferenceId>
    <consigneeAdditionalInfo></consigneeAdditionalInfo>
    <latitude></latitude>
    <longitude></longitude>
</XConsigneeCustAddress>

<payerCustData>
    <invCustId>test</invCustId>
    <invAddressId></invAddressId>
</payerCustData>
</ngis:createNgiShipmentWithAddress>
</soapenv:Body>
</soapenv:Envelope>